In [1]:
import pandas as pd
import numpy as np

In [3]:
# read the csv file and display the data frame
df = pd.read_csv('StudentsPerformance.csv')
df.head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93

### Attributes

In [4]:
df.shape

(1000, 8)

In [5]:
df.index

RangeIndex(start=0, stop=1000, step=1)

In [6]:
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [7]:
df.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

### Functions

In [15]:
# len() - returns the number of items in an object
print(f'number of rows in the data frame - {len(df)}')

number of rows in the data frame - 1000

In [16]:
# type() - returns data type
print(f'data type of the data frame - {type(df)}')

data type of the data frame - <class 'pandas.core.frame.DataFrame'>

In [11]:
# max(), min()
print(f'highest index in the data frame - {max(df.index)}')
print(f'lowest index in the data frame - {min(df.index)}')

highest index in the data frame - 999
lowest index in the data frame - 0

In [19]:
# round() - rounds a data frame to a variable number of decimal places
df['math score'] = 70.2456
round(df, 2).head(3)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,70.25,72,74
1,female,group C,some college,standard,completed,70.25,90,88
2,female,group B,master's degree,standard,none,70.25,95,93

### Methods

In [28]:
# show first five rows in a data frame
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [30]:
# show last five rows in a data frame
df.tail()

# show last n rows in a data frame
# df.tail(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [34]:
# showing info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [36]:
# describe data frame's basic statistics
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [20]:
# count gender elements - len() provides same output
df['gender'].count()

1000

In [21]:
# count gender elements by category
df['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [63]:
# return the relative frequency - divide values by the sum of all values and round to 2 decimals
df['gender'].value_counts(normalize=True).round(2)

gender
female    0.52
male      0.48
Name: proportion, dtype: float64